{
  "recipeData": [{
    "id": 1,
    "name": "Avocado Tomato Toast",
    "serves": 1,
    "uses": "Avocado, Tomato, Thyme, Bread",
    "consume": "Consume within 2 days",
    "image": "avocadoTomatoToast",
    "macronutrients": {
      "calories": 290,
      "protein": 7,
      "carbohydrates": 25,
      "fats": 12,
      "fiber": 7
    },
    "ingredients": ["1 avocado", "1 tomato", "2 bread", "1 thyme", "salt and pepper"],
    "instructions": [
      "Lightly toast the 2 slices of white bread until golden and crisp.",
      "Prepare the avocado by cutting the avocado in half, removing the pit, and scooping the flesh into a bowl. Mash the avocado with a fork and season with salt and pepper.",
      "Cut the tomato into thin slices.",
      "Assemble the toast. Spread the mashed avocado evenly over the toasted bread. Top with sliced tomatoes.",
      "Finish off your toast with a drizzle with olive oil and sprinkle fresh thyme on top. Add more salt and pepper if desired."
    ]
  },
  {
    "id": 2,
    "name": "Pumpkin Soup",
    "serves": 4,
    "uses": "Pumpkin, Garlic, Carrot, Yogurt, Milk",
    "consume": "Consume within 2 days",
    "image": "pumpkinSoup",
    "macronutrients": {
      "calories": 452,
      "protein": 10,
      "carbohydrates": 43,
      "fats": 29,
      "fiber": 7
    },
    "ingredients": ["120 g pumpkin", "2 garlic", "2 carrots", "1 cup yogurt", "2 tsp milk"],
    "instructions": [
      "Roast or steam pumpkin until soft for about 10 - 12 minutes. You can test it’s doneness by poking a fork into it, it should be soft and the fork should easily pierce through. ",
      "Saute garlic in olive oil. Add pumpkin and water and simmer for 2-3 minutes. ",
      "Blend the mixture using a blender or hand held blender until smooth. Stir in the yogurt and milk. Heat gently and add salt and pepper to taste."
    ]
  },
  {
    "id": 3,
    "name": "Salmon Rice Bowl",
    "serves": 2,
    "uses": "Salmon, Rice, Broccoli, Cucumber, Soy Sauce, Honey",
    "consume": "Consume within 2 days",
    "image": "salmonRiceBowl",
    "macronutrients": {
      "calories": 470,
      "protein": 28,
      "carbohydrates": 30,
      "fats": 29,
      "fiber": 5
    },
    "ingredients": ["1 salmon fillet", "1 cup of rice", "4 broccoli florets", "1 cucumber", "1 tbsp soy sauce", "1 tbsp honey", "salt and pepper"],
    "instructions": [
      "Cook the rice using a rice cooker or pot.",
      "Rinse the salmon and pat dry. Coat salmon with salt and pepper, then heat oil in a pan until mildly hot. Sear each side of the salmon for 3 minutes. Remove immediately to prevent overcooking.",
      "Mix the honey, soy sauce, and water and add to the pan. Cook it until it thickens.",
      "To assemble, place the rice on the bottom, the cooked salmon, the veggies on the side, and spread the sauce on top."
    ]
  },
  {
    "id": 4,
    "name": "Greek Yogurt Dip",
    "serves": 4,
    "uses": "Yogurt, Carrot, Cucumber, Parsley, Dill, Lemon",
    "consume": "Consume within 2 days",
    "image": "greekYogurtDip",
    "macronutrients": {
      "calories": 136,
      "protein": 20,
      "carbohydrates": 12,
      "fats": 5,
      "fiber": 4
    },
    "ingredients": ["1 yogurt", "1 carrot", "1 cucumber", "1 tbsp dill", "1 lemon"],
    "instructions": [
      "Chop the cucumber and carrot into bite sized pieces.",
      "Measure the Greek yoghurt into a medium bowl. Stir in the parsley, dill, lemon juice, salt, pepper until well incorporated. Taste and adjust the seasonings, adding more salt if necessary.",
      "Cover and chill for at least 4 hours up to overnight to allow the flavors to blend. Garnish with additional fresh herbs and serve with the cucumber and carrots."
    ]
  },
  {
    "id": 5,
    "name": "Shrimp Veggie Stir Fry",
    "serves": 1,
    "uses": "Shrimp, Egg, Bok Choy, Bell Pepper, Rice, Broccoli, Soy Sauce, Garlic",
    "consume": "Consume within 2 days",
    "image": "shrimpVeggieStirFry",
    "macronutrients": {
      "calories": 410,
      "protein": 30,
      "carbohydrates": 30,
      "fats": 18,
      "fiber": 7
    },
    "ingredients": ["100 g shrimp", "1 egg", "4 broccoli florets", "2 bok choy", "1/2 bell pepper", "1 cup of rice", "1 tbsp soy sauce", "1/2 garlic"],
    "instructions": [
      "In a nonstick skillet or wok, heat 1/2 tsp oil over medium heat. Add broccoli, yellow pepper, and bok choy. Stir fry for 3-4 minutes, adding a splash of water if needed to steam.",
      "Push the veggies to the side and add another 1/2 tsp oil, then add the shrimp. Cook until pink and firm.",
      "Crack 1 egg and quickly scramble it into the pan. Mix into veggies and shrimp as it cooks. Season with soy sauce and salt.",
      "Serve by adding cooked rice and top with the shrimp stir fry."
    ]
  }
]}